Revit 2016 API
FabricationConfigurationInfo Methods
The FabricationConfigurationInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindSourceFabricationConfiguration
 Finds the source fabrication configuration on disk which matches the input fabrication configuration.
GetAllFabricationConfigurations
 Gets all added fabrication configurations.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Checks if the fabrication configuration is valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace